{
  "backend/main.mo": "Empty Motoko actor with no methods implemented.",
  "feature_evidence.json": "Metadata describing a deployment-guide feature, including related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for various frontend source files.",
  "frontend/DEPLOYMENT.md": "Deployment guide outlining prerequisites and steps for publishing the app to the Internet Computer mainnet.",
  "frontend/index.css": "Tailwind-based global stylesheet defining a warm amber/orange color palette for light and dark modes.",
  "frontend/index.html": "HTML entry point loading the React app and Google AdSense script.",
  "frontend/src/App.tsx": "Main React component managing page navigation and rendering tool pages within the layout.",
  "frontend/src/components/AppLayout.tsx": "Layout wrapper providing header, navigation, ad banner sections, and footer around all pages.",
  "frontend/src/components/ImagePreview.tsx": "Component showing original and resized images side‑by‑side with dimensions.",
  "frontend/src/components/QrPreview.tsx": "Canvas-based renderer that draws a QR code from a boolean matrix.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing a backend actor instance tied to the user’s identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Authentication context and hook managing Internet Identity login, logout, and stored identity state.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hook returning no backend queries since the app is frontend‑only.",
  "frontend/src/index.css": "No summary available.",
  "frontend/src/lib/image.ts": "Provides an async function to resize an image using a canvas and return the resized image as a blob URL.",
  "frontend/src/lib/names.ts": "Generates unique random first, last, or full names from predefined lists.",
  "frontend/src/lib/password.ts": "Creates secure random passwords based on length and character-type options using crypto-safe randomness.",
  "frontend/src/lib/qr.ts": "Builds a simple QR-like boolean matrix with finder and timing patterns and text-based data encoding.",
  "frontend/src/lib/units.ts": "Defines unit categories and conversion functions for length, weight, temperature, and volume.",
  "frontend/src/main.tsx": "Initializes the app root with React, React Query, and Internet Identity provider.",
  "frontend/src/pages/HubPage.tsx": "Displays a grid of tool cards and handles navigation to each utility page.",
  "frontend/src/pages/ImageResizerPage.tsx": "Provides UI to upload, resize, preview, and download images with optional aspect ratio locking.",
  "frontend/src/pages/PasswordPage.tsx": "Offers UI for generating customizable passwords and copying them to the clipboard.",
  "frontend/src/pages/QrCodePage.tsx": "Page that generates a QR matrix from user text, displays a preview, and allows downloading as a PNG.",
  "frontend/src/pages/RandomNamePage.tsx": "Page that generates random names based on count and style, with per‑name and bulk copy-to-clipboard actions.",
  "frontend/src/pages/UnitConverterPage.tsx": "Unit conversion page that selects categories and units, converts values, and updates output reactively.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, animations, and layout settings, with typography, container queries, and animate plugins.",
  "project_state.json": "Project metadata describing implemented tools, features, requirements, and overall app state."
}