{
  "kind": "build_request",
  "title": "Deploy the current Micro Tools Hub build to Internet Computer mainnet (live)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-42",
      "text": "Deploy the current application build to the Internet Computer mainnet (ic network) using the steps documented in frontend/DEPLOYMENT.md, producing an updated live canister deployment.",
      "target": "unknown",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "No this is perfect. Publish to live"
        ]
      },
      "acceptanceCriteria": [
        "Deployment is executed against the `ic` network (not local).",
        "The deployment completes successfully without errors.",
        "The deployed app loads on mainnet and serves the latest UI (including the Hub and the latest tool pages)."
      ]
    },
    {
      "id": "REQ-43",
      "text": "Perform a brief post-deploy verification on mainnet to confirm core navigation and critical pages work and that ad placement areas render in the layout.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Publish to live"
        ]
      },
      "acceptanceCriteria": [
        "On mainnet, the Hub page loads and navigation to Popular Tools, Text & Writing Tools, Number & Conversion Tools, and Daily Utilities works.",
        "On mainnet, the top banner area renders below the header and above the main content and shows the placeholder label \"Advertisement\".",
        "On mainnet, the bottom banner area renders above the footer and shows the placeholder label \"Advertisement\".",
        "The /ads.txt asset is accessible at the root path `/ads.txt` on the deployed site and contains the expected AdSense line."
      ]
    }
  ],
  "constraints": [
    "Follow the documented deployment process in frontend/DEPLOYMENT.md.",
    "Deploy to the Internet Computer mainnet using the `ic` network."
  ],
  "nonGoals": [
    "Adding new tools or modifying existing tool functionality as part of this deployment.",
    "Changing the AdSense script snippet or ad placement design as part of this deployment."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}