{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Deploy Micro Tools Hub to Internet Computer mainnet (ic) with post-deploy verification",
  "requirements": [
    {
      "id": "REQ-42",
      "summary": "Update deployment documentation to ensure the current build is deployed to Internet Computer mainnet (`ic`) successfully using the documented process.",
      "acceptanceCriteria": [
        "Deployment is executed against the `ic` network (not local).",
        "The deployment completes successfully without errors.",
        "The deployed app loads on mainnet and serves the latest UI (including the Hub and the latest tool pages)."
      ],
      "file_operations": [
        {
          "path": "frontend/DEPLOYMENT.md",
          "operation": "modify",
          "description": "Complete and clarify the documented mainnet deployment process to explicitly use the `ic` network (including build + deploy steps, required environment/prereqs, and any verification pointers), ensuring it matches the current repository structure and produces an updated live canister deployment."
        }
      ]
    },
    {
      "id": "REQ-43",
      "summary": "Add a brief post-deploy verification checklist/script to confirm mainnet navigation, ad placeholder regions, and ads.txt availability.",
      "acceptanceCriteria": [
        "On mainnet, the Hub page loads and navigation to Popular Tools, Text & Writing Tools, Number & Conversion Tools, and Daily Utilities works.",
        "On mainnet, the top banner area renders below the header and above the main content and shows the placeholder label \"Advertisement\".",
        "On mainnet, the bottom banner area renders above the footer and shows the placeholder label \"Advertisement\".",
        "The /ads.txt asset is accessible at the root path `/ads.txt` on the deployed site and contains the expected AdSense line."
      ],
      "file_operations": [
        {
          "path": "frontend/DEPLOYMENT.md",
          "operation": "modify",
          "description": "Add a concise post-deploy verification section documenting the required mainnet checks: Hub navigation to Popular Tools/Text & Writing Tools/Number & Conversion Tools/Daily Utilities, visibility of the top and bottom \"Advertisement\" placeholder areas in the shared layout, and validation that `/ads.txt` is served and matches the expected AdSense line."
        },
        {
          "path": "frontend/scripts/post-deploy-verify.sh",
          "operation": "create",
          "description": "Create a lightweight post-deploy verification helper that (a) prompts for the deployed mainnet URL, (b) checks that `/ads.txt` is reachable and contains the expected AdSense line from `frontend/public/ads.txt`, and (c) prints the manual navigation and ad-placeholder verification steps to complete in the browser on mainnet."
        }
      ]
    }
  ]
}